[{
		"directions": "Cut the fish into small pieces: You can dice it or leave it in pieces up to 1 inch square, but remember that the larger the pieces the longer it will take to marinate. Salt the fish, then cover with the citrus juice in a non-reactive (glass or plastic) container with a lid. Add the sliced onions and the chiles. Chill this in the fridge for at least 2 hours, possibly as much as 3 hours -- very large pieces can take longer. If your fish is truly raw-eating quality, it is OK if the centers of the pieces are still raw-looking. To serve, lay down some of the onions and chiles and top with the fish. Garnish with the cilantro. Submit a Correction",
		"url": "http://www.food.com/recipe/peruvian-ceviche-456818",
		"title": "Peruvian Ceviche",
		"description": "Like carpaccio, ceviche (seh-VEE-chay) is a raw fish recipe that modern cooks just love to play with. It is essentially fish \"cooked\" in the acid of citrus juice and served with a cold beer on a hot day. The dish originates in Peru, and is thought to be a development from Spanish escabeche, which is a vinegar-marinated dish. This recipe is for the classic Peruvian ceviche. Ceviche is so sharp and acidic it cries out for beer and tortilla chips as an accompaniment -- although you won't find tortilla chips in Peru. In Peru, you will most often find this served with potatoes, either sweet or white.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["1 lb fish fillet, white saltwater (albacore, sole, snapper, halibut anything you would see on a sushi menu)", "1 cup lime juice, key limes if you can get them", "1⁄2 cup lemon juice", "1⁄2 cup orange juice", "1 tablespoon salt", "1 rocoto chilies (chile manzano in Mexican markets) or 2 aji amarillo chilies (substitute a habanero)", "1 medium onion, sliced very thinly into half-moons", "4 tablespoons cilantro, chopped"]
	},
	{
		"directions": "The original recipe is done with Peruvian white corn, it has the biggest grain in the world and it can be cut off the cob and peeled to prepare for the recipe, but I substituted it for just the frozen bags that we can find in any grocery store. Preferably, grind the corn using a grinding machine , not blender (as last resource you can blend the corn in a good blender using very little liquid). Set aside. Blend the salt, pepper, cumin, vinegar and red dried chile (previously roasted and deveined). Cut the meat into medium sized pieces and marinade for about an hour in the previous mix. Brown the meat in a teaspoon of lard, add the left over marinade and the two cups of water, and bring it to a boil, simmer to cook for two hours. Remove the pieces of meat and set aside. Add the broth to the corn, the rest of the lard, peanuts, sesame seeds, 6 yolks and the glass of Pisco ( if you can't find Peruvian Pisco leave it like that, don't substitute). Work the dough until it makes \"eyes\", or air bubbles. Set aside. To prepare the banana leaves you must pass them quickly over open fire (gas burner) or grill, exposure to high heat will bring out the flavors they release and turn them flexible enough to be used as wrapping. Make sure to take off the thick nerve like center of the leave. To put the tamales together:. take about three spoonfuls of dough and place them on the center of a piece of banana leaf. dig a hole in the middle and place a piece of meat, a piece of egg, an olive, one peanut, and a wedge of the fresh aji Mirasol, this may be substituted by any fresh chile, although the aji Mirasol or aji amarillo (yellow chile) has a very distinctive flavor and is just mildly spicy. Close the hole on the dough by adding a little bit more dough or folding and tapping it closed,pushing some of the surrounding dough on it. Wrap well with the banana leaf, closing tightly all four sides on top of the dough. Use another piece of banana leaf to wrap the tamal again starting on the opposite direction and tie tightly using a string cut out of some more banana leaf or a common piece of string. Set aside. Place the corn cobs at the bottom of a deep pot (rather big or medium size)and some of the banana leaves on top of the corn cobs. Add just enough water to cover the leaves. Place the tamales vertically and side by side so the steam travels freely through them and cover them with the rest of the banana leaves. Cook for about 4 hours. Serve with a type of onion salad called salsa criolla. Salsa Criolla:. Chop a whole onion julienne style, rinse once with water and salt, and pat dry. Cut one or two small tomatoes in thin wedges. Add two tablespoons of mint leaves, two tablespoons of cilantro leaves, and one fresh aji amarillo (yellow chile) deveined and sliced. Toss everything together and add the juice of half a lime, freshly squeezed. Season with salt and pepper to taste. Serve each tamal warm, unwrapped, and with a couple of spoonfuls of salsa criolla on top. Decorate topping with a branch of parsley or cilantro. For Sunday breakfast place a roll of fresh french bread on the side of the dish. ENJOY! Submit a Correction",
		"url": "http://www.food.com/recipe/peruvian-tamales-criollos-182974",
		"title": "Peruvian Tamales Criollos",
		"description": "Red tamales Peruvian style. One of the most traditional dishes of Peruvian cuisine, people enjoy them for Sunday breakfast served with salsa criolla and crispy french bread rolls. Moist, slightly spicy, and with an exotic flavor provided by the banana leave wrapping; stuffed traditionally with pork or chicken. Try them you will love them!",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["2 lbs of peeled white corn", "2 1⁄2 lbs pork chops (no bones)", "6 dried red chilies", "2 fresh yellow chilies, roasted (Aji MIrasol)", "6 egg yolks", "2 hard-boiled eggs, cut into eight pieces (wedges, not slices)", "2 tablespoons vinegar", "8 freshh garlic cloves, peeled", "1⁄2 teaspoon ground pepper", "1⁄2 teaspoon ground cumin", "50 g roasted sesame seeds", "100 g roasted peanuts (ground)", "1⁄2 lb pork fat", "2 cups water", "100 g black olives (preferably Peruvian)", "1 lb banana leaf (cut in 12-inch X 18-inch pieces)", "string", "10 ears corn on the cob (without kernels)"]
	},
	{
		"directions": "Place steak in 1 bowl and onions in another. Using a knife, make a paste by combining garlic and 1/4 teaspoon salt. Whisk together garlic paste, vinegar, soy sauce, 2 tablespoons of olive oil, cumin and ground black pepper. Divide marinade between steak and onions. Refrigerate for 1/2 hour. While steak is marinating, cook potatoes. Drizzle them with 2 tablespoons of olive oil and sprinkle with paprika. Put in a 375 degree oven and roast. Check them after 6 minutes and toss with a spatula. Depending on how thick you cut them, they should cook fairly quickly, so keep an eye on them; set aside. Before cooking, allow steak and onions to come to room temperature. Place steak on in a hot saute pan with a little oil and cook about 4 minutes per side for medium-rare, depending on which cut you are using. Discard marinade. When done, let steak rest before slicing. Place onions face down in saute pan and cook until slightly soft, about 6 minutes per side. When done, cut onions into wedges. In a large bowl combine steak and juices, onions, peppers, tomatoes, cilantro and reserved marinade. Toss gently and adjust seasoning with salt and pepper, if needed. Season potatoes and place on top of meat and vegetables. Serve warm. Submit a Correction",
		"url": "http://www.food.com/recipe/lomo-saltado-peruvian-483864",
		"title": "Lomo Saltado (Peruvian)",
		"description": "Lomo Saltado is a Peruvian dish served with white rice on the side and fried potatoes served on top of the meat and vegetables. While this may sound odd, potatoes are originally from Peru and they are used in every possible way. Many Japanese moved to Peru several generations ago. The soy sauce gives good depth to the marinade.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["1 -1 1⁄2 lb skirt steaks, petite fillets, hanger or 1 -1 1⁄2 lb flat iron steak", "2 medium red onions, cut in half lengthwise", "1 red bell peppers or 1 green bell pepper, cut into strips", "1 -2 jalapeno pepper, seeds removed and sliced into strips (optional)", "2 garlic cloves, minced", "1⁄4 teaspoon sea salt", "4 teaspoons red wine or 4 teaspoons sherry wine vinegar", "4 teaspoons soy sauce", "4 tablespoons olive oil, divided", "1 teaspoon ground cumin", "3⁄4 teaspoon ground black pepper", "5 medium yukon gold potatoes, peeled and cut into French-fry like strips", "1⁄2 teaspoon paprika", "2 medium tomatoes, cut into wedges", "1⁄4 cup chopped cilantro leaf"]
	},
	{
		"directions": "Melt 2 tablespoons of butter in a pot and cook the onion with the tomatoes. Add the bay leaf, thyme and worcestershire sauce. Incorporate 1 cup of of milk and 1/2 cup of the stock, add salt and put the fish fillets in the pot. Cook for a few minutes, remove the fish from the pot and strain the sauce. Reserve. Melt in a saucepan the rest of the butter. Add the flour sifted and stir so there are no lumps. Incorporate the remaining milk and stock and when it starts boiling, add the reserved sauce and the curry dissolved in a little bit of water. Add the fish to the pot again and cook 4 to 5 minutes aproximately, so the sauce thickens. Serve inmediately. Submit a Correction",
		"url": "http://www.food.com/recipe/pescado-oriental-oriental-fish-364028",
		"title": "Pescado Oriental (Oriental Fish)",
		"description": "Peruvian delicious exotic plate!",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["2 1⁄2 lbs white fish fillets", "4 tablespoons butter", "1⁄2 grated onion", "2 ripe tomatoes, peeled and chopped", "1 bay leaf", "thyme, to taste", "1 teaspoon Worcestershire sauce", "1 1⁄2 cups milk", "1 cup fish stock", "2 1⁄2 tablespoons flour", "1 teaspoon curry powder", "salt"]
	},
	{
		"directions": "Soak wheat in water for approximately 3 hours. Aside, heat oil in a pan, sautee onion, garlic, hot yellow pepper paste, stir and season with salt and pepper. Add wheat. Pour enough water or stock to cover wheat. Cook in low heat until done. Add more water or stock as needed while cooking. Add cheese, scallions stir well. Check and rectify seasoning if needed. Submit a Correction",
		"url": "http://www.food.com/recipe/trigo-atamalado-455347",
		"title": "Trigo Atamalado",
		"description": "Taken from great-peruvian-recipes.com and posted for ZWT7",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["1 lb wheat", "1⁄2 cup oil", "1 onion, chopped", "3 garlic cloves, minced", "2 teaspoons hot yellow peppers, paste", "salt", "pepper", "water or stock", "1⁄2 cup fresh cheese, cut into small pieces", "2 scallions, finely chopped"]
	},
	{
		"directions": "Add all ingredients in the order directed by your bread machine manual. Process on the bread cycle according to the manual. Submit a Correction",
		"url": "http://www.food.com/recipe/madges-quinoa-bread-for-abm-510768",
		"title": "Madge's Quinoa Bread for ABM",
		"description": "Entered for safe-keeping, from \"The Best Bread Machine Cookbook Ever: Ethnic Breads\" by Madge Rosenberg. Did you know that 2013 is the International Year of Quinoa? The Andean countries of Bolivia, Peru and Ecuador supply the healthy gluten-free quinoa grain (although this recipe also calls for bread flour). This is a sweet, cake-y bread, but protein-rich and vitamin-rich as well. Serve on a platter with sliced mango, pineapple or berries. For best flavor, make sure your ground cloves are fresh. Makes a 1 1/2 pound loaf.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["2 1⁄4 teaspoons active dry yeast", "2 1⁄4 cups bread flour", "1 cup cooked quinoa", "2 tablespoons cooked quinoa", "3⁄4 cup brown sugar", "1 1⁄2 teaspoons ground cinnamon", "3⁄4 teaspoon ground cloves", "3⁄4 teaspoon salt", "3⁄4 cup walnuts, chopped", "1 1⁄2 teaspoons vanilla extract", "3 tablespoons vegetable oil", "3 whole eggs", "1⁄2 cup water"]
	},
	{
		"directions": "Preheat oven to 350, or recommended temperature stated on your cresent roll package. Coat bottom of a baking pan with cooking spray. In a medium skillet, heat oil and add the diced bell pepper. Cook until tender, then add the diced onion. Cook another 4-5 minutes. Remove from pan when done and set aside. Season ground beef with salt, pepper, and cumin. Using the same skillet, brown the beef. When it's almost done, toss in the tomatos & bell pepper/onion mixture. Mix together and cook for another 3-4 minutes or until beef is done. On a floured cutting board, roll out cresent roll dough. Take special care to make sure they do not seperate. Dip your fingers in a little flour and pinch all of the serrations closed. Roll out dough to desired thickness. lightly flour the top of the dough and cut out rounds from it using a biscuit cutter or open can dipped in flour. Add beef mixture into the center of each round and top with a slice of egg. Fold the crust so the top and bottom edges meet. Crimp edges together using a fork dipped in flour. Coat the tops of the empanadas with an egg wash and place on baking sheet. Cook for 15 minutes or until golden. For a peruvian touch, drizzle with lime juice and sprinkle with powdered sugar. Submit a Correction",
		"url": "http://www.food.com/recipe/easy-beef-empanadas-262554",
		"title": "Easy Beef Empanadas",
		"description": "I love these empanadas! I make this version when I just don't have time a lot of time. The tomatoes in the filling keep it moist.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["1 lb ground beef", "1 (10 ounce) can crescent rolls", "1 1⁄2 cups crushed tomatoes with garlic", "2 eggs, boiled and sliced", "1 red bell pepper, diced", "1 yellow onion, diced", "1 teaspoon cumin", "2 eggs, beaten", "lime", "powdered sugar (optional)"]
	},
	{
		"directions": "Fill water in a large pan with cinnamon, clove, and aniseed. Boil for 10 min, and strain reserving water. Cook sweet potatoes and squash in the reserved water until tender. Remove pan and force through a strainer. Reserve 2 cups of cooking liquid and allow to cool. In a small bowl, combine yeast, sugar and reserved cooking liquid. Set aside for 15 minutes. Place strained sweet potatoes and squash in a large bowl. add salt, yeast mixture and eggs; stir until combined. Fold in flour and continue stirring until soft and smooth and elastic dough is formed. Cover with a damp cloth and leave dough to rise for 1 hour. Heat oil in a large skillet until hot. Take a small quantity of dough and form a ring. Fry in hot oil until golden on both sides. Repeat until all is used. Drain on paper napkins. Syrup:. combine sugar, clove, cinnamon, orange peel, allspice and water in a medium saucepan. Bring to boil over low heat until mixture thickens to a syrup. It will take around 20-25 minutes. Submit a Correction",
		"url": "http://www.food.com/recipe/picarones-362432",
		"title": "Picarones",
		"description": "A great Peruvian desert that I love and miss. If you wet your hands in salted water frequently--it makes the dough more manageable:)",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["1 lb sweet potato, peeled", "1 lb squash, peeled", "1 lb flour", "3 tablespoons fresh yeast", "2 cinnamon sticks", "4 cloves", "2 tablespoons anise seed", "3 tablespoons sugar", "1 pinch salt", "2 eggs, slightly beaten", "oil, necessary amount for frying", "2 cups dark brown sugar", "2 cups white sugar", "4 cloves", "2 cinnamon sticks", "2 allspice", "1 orange peel, cut into thick large strips", "4 cups water"]
	},
	{
		"directions": "Toss greens with the vinaigrette and let set. Saute onion, peppers, and mushrooms in a small amount of olive oil and butter. Salt and pepper, to taste. Add quinoa, sprinkle with rosemary and thyme. Pour over greens and serve. Submit a Correction",
		"url": "http://www.food.com/recipe/quinoa-salad-437082",
		"title": "Quinoa Salad",
		"description": "Quinoa was held sacred by the Incas and they referred to it as the mother of all grains. This recipe is from Cafe Shi in Ames, Iowa",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["2 cups mixed greens", "1⁄4 cup vinaigrette (any kind)", "1⁄4 cup red onion, diced", "1⁄4 cup red pepper, diced", "1⁄4 cup yellow pepper, diced", "1⁄4 cup mushroom, diced", "1⁄2 cup quinoa, cooked", "olive oil", "butter", "salt and pepper, to taste", "rosemary, to taste", "thyme, to taste"]
	},
	{
		"directions": "Place first 4 ingredients in sauce pan. Pour in water. Simmer over medium high heat. Skim off foam then reduce heat cover and simmer until chicken is tender (30 min). Remove chicken to plate - cool. Strain chicken stock, discard veggies. Pour milk and 1/2 cup chicken stock in blender and add bread cubes. Puree until smooth - add Parmesan cheese and puree until smooth. Shred chicken. Boil potatoes whole - once soft slice in half, then pour the aji de gallina sauce over the potatoes, garnishing with walnuts and hard boiled eggs. Heat vegetable oil in pan over medium heat. Stir in garlic and onion - 5 minutes. Stir in chicken and aji sauce until hot and puree. Stir frequently (and chicken stock if too thick) add tumeric and garnish with sliced eggs and walnuts. Submit a Correction",
		"url": "http://www.food.com/recipe/aji-de-gallina-456133",
		"title": "Aji De Gallina",
		"description": "This recipe was given to me by one of my dearest friends who is living in Peru on the mission field. This is her favorite Peruvian dish! (The recipe differs somewhat from others on the site and is supposed to be very authentic.)",
		"small": "https://github.com/Ahuire-Ricardo/Ahuire-Ricardo.github.io/blob/master/FoodDeliveyApp/images/AjiGallina-small.jpg",
		"medium": "https://github.com/Ahuire-Ricardo/Ahuire-Ricardo.github.io/blob/master/FoodDeliveyApp/images/AjiGallina-medium.jpg",
		"large": "https://github.com/Ahuire-Ricardo/Ahuire-Ricardo.github.io/blob/master/FoodDeliveyApp/images/AjiGallina-large.jpg",
		"ingredients": ["2 lbs chicken", "1 onion, coarsely chopped", "2 carrots, coarsley chopped", "2 garlic cloves, minced", "8 cups water", "1 loaf bread (no crust)", "1 (12 ounce) can evaporated milk", "1⁄2 cup parmesan cheese, grated", "1⁄4 cup walnuts", "1 teaspoon vegetable oil", "1 garlic clove", "1 onion, chopped", "2 teaspoons aji yellow paste", "2 teaspoons ground turmeric", "2 hard-boiled eggs, sliced", "4 -5 potatoes"]
	},
	{
		"directions": "Seed rocoto and cut into large pieces. (Wear gloves, and be careful about touching your face or eyes. These peppers are hot!). Place pepper, milk, and lime juice in blender. With the blender running, slowly add oil, to form a creamy sauce. Add salt to taste. Submit a Correction",
		"url": "http://www.food.com/recipe/rocoto-sauce-306563",
		"title": "Rocoto Sauce",
		"description": "Rocoto (or locoto, or manzano) peppers are one of the earliest peppers domesticated, some 6,000 years ago. This sauce recipe is from Yanuq.com.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["1 rocoto chile pepper", "1⁄2 cup evaporated milk", "1 key lime, juice of", "1 cup oil", "1 teaspoon salt"]
	},
	{
		"directions": "Combine vinegar, cayenne, saffron, garlic, peppercorns, salt and water in a large bowl. Add meat and mix well. Cover and refrigerate overnight. Preheat grill to high. Remove meat from marinade and place on skewers. Brush with olive oil. Grill until tender, 3-4 minutes on each side. Submit a Correction",
		"url": "http://www.food.com/recipe/anticuchos-beef-heart-kebabs-469533",
		"title": "Anticuchos (Beef Heart Kebabs)",
		"description": "Another recipe for the popular Peruvian street food. Adapted from Pan American's Complete Round the World Cookbook. Prep time does not include overnight marinating time.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["1 cup tarragon vinegar", "1⁄2 teaspoon ground cayenne pepper", "1⁄4 teaspoon saffron", "3 garlic cloves, minced", "12 black peppercorns", "1 teaspoon salt (to taste)", "1⁄2 cup water", "2 lbs beef heart meat, cut in 1-inch cubes", "3 tablespoons olive oil"]
	},
	{
		"directions": "In a ceramic bowl, combine the lemon juice, ground chile, salt, black pepper, and the onion slices. Allow to marinate at room temperature for 1-2 hours. In a blender puree the cheese, fresh chiles, turmeric, and the cream. If the mixture seems too thick, add more cream, a little at a time. Heat the oil in a skillet. Pour in the cheese-cream mixture and reduce the heat to very low. Cook for a few minutes, stirring constantly until the sauce is smooth and thick and creamy. Arrange the lettuce leaves on a platter or on individual plates. Top the leaves with the potatoes, cut side down, and pour the sauce over the potatoes. Garnish the platter or plates with the eggs, corn slices, and the olives. Drain the onion rings and mop up any excess with paper towels. Arrange the onion rings over the potatoes. Submit a Correction",
		"url": "http://www.food.com/recipe/papas-huancaino-44772",
		"title": "Papas a la Huancaina",
		"description": "This is a take on a popular potato dish from the highlands of Peru. It strays from more traditional recipes because it has been adapted to use more easy-to-find ingredients, but it is still a very tasty and spicy dish -- originally from the Andes mountain town of Huancayo.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["1 small lemon, juiced", "1 teaspoon chili powder", "1⁄2 teaspoon salt", "1⁄4 teaspoon fresh ground black pepper", "1 medium onion, thinly sliced and separated into rings", "1 1⁄2 cups grated monterey jack cheese or 1 1⁄2 cups muenster cheese, preferred", "2 fresh jalapeno peppers, halved,seeds and stems removed", "1⁄2 teaspoon turmeric", "1 -1 1⁄2 cup half-and-half", "1⁄3 cup olive oil", "8 leaves bibb lettuce (Boston)", "8 medium potatoes, boiled,peeled,and halved lengthwise", "4 hard-boiled eggs, halved lengthwise", "1⁄2 cup sweetcorn", "1⁄2 cup sliced black olives"]
	},
	{
		"directions": "Season chicken with salt and pepper. Dredge in flour. Heat oil in large pot over medium-high heat. Fry chicken in batches, 4 minutes per side until lightly browned; transfer to plate. Add onion, garlic, tomato paste, paprika, and the wine to the pot. Cook 3 minutes, stirring a few times. Add chicken broth, carrots, and potatoes. Simmer, covered for 5 minutes. Add back in chicken pieces and cover with sauce. Simmer covered about 25 minutes or until potatoes are tender. Stir in raisins during last 5 minutes of cooking. Submit a Correction",
		"url": "http://www.food.com/recipe/estofado-de-pollo-399892",
		"title": "Estofado De Pollo",
		"description": "Peruvian. There isn't a whole lot of wow factor here but it is a good mild dish that is fairly easy to make that my whole family will eat. The raisins add a nice sweetness as does the paprika but overall it is a rather bland dish that some may find comforting.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["6 -8 bone-in chicken thighs, skin removed", "1⁄2 teaspoon salt", "1⁄4 teaspoon black pepper", "1⁄2 cup all-purpose flour", "1⁄4 cup olive oil", "1 cup onion, chopped", "1 garlic clove, peeled and chopped", "2 tablespoons tomato paste", "2 tablespoons paprika", "1⁄2 cup white wine", "2 cups chicken broth", "1 cup carrot, sliced", "4 medium potatoes, peeled and quartered", "1 cup frozen peas", "1⁄4 cup raisins"]
	},
	{
		"directions": "Cut the beef into hunks and season with salt, pepper, cumin powder, and garlic paste. Heat a little vegetable (or olive) oil in a stainless steel soup pot and pan fry the meat. When the meat is seared, add the chopped onion, ají panca, and ají amarillo. Stir until onion becomes translucent. Rinse the cilantro in water and cut off the bottom few inches from the stems. Chop by hand and transfer to blender. Add about 1/2 to 1 cup water to the blender and reduce the fresh chopped cilantro to liquid. Add liquid cilantro to soup pot, stir, lower heat and cover with lid. The meat will become tender, cooking in the liquid for at least 20 minutes. Add frozen peas, stir and cook covered another 10 minutes. Serve with white rice. Submit a Correction",
		"url": "http://www.food.com/recipe/seco-de-carne-443779",
		"title": "Seco De Carne",
		"description": "Traditional peruvian beef dish.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["2 lbs bottom round steaks", "1 chopped red onion (or yellow)", "2 tablespoons garlic paste", "1 bunch fresh cilantro", "1 cup frozen peas", "1 tablespoon aji bell pepper (panca)", "1 tablespoon aji yellow paste (amarillo)", "vegetable oil (or olive)", "water", "salt, pepper, cumin powder to taste"]
	},
	{
		"directions": "Melt the butter/margarine in the pot at medium heat. Add the garlic. Once the garlic is browning, add your chicken pieces. When chicken is lightly browned on both sides, add the onions diced. Once onions are almost fully cooked, add the oxtail soup. Stir lightly to spread the oxtail over the chicken pieces, then add half the can of coke and continue stirring at medium heat. Boil your potatoes and carrots (seperately) in the meantime. I prefer to do them in the microwave which is fairly quick. When the sauce has begun to thicken, add the potatoes and carrots cut into bite sizes. Simmer at low-medium heat. Add the bay leaf. Taste it, if it's too sour still, add a bit more coke. Serve warm over a bed of rice or pasta. Submit a Correction",
		"url": "http://www.food.com/recipe/chicken-in-coca-cola-193852",
		"title": "Chicken in Coca-Cola",
		"description": "This is a very popular meal where I come from (PERU) and it's quite a success with all ages. Easy to make and sweet to the palate.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["2 chicken breasts", "1 teaspoon instant minced garlic (to taste)", "1 white onion", "2 potatoes", "3 carrots", "2 tablespoons margarine or 2 tablespoons butter", "1 bay leaf", "1 (750 ml) can Coca-Cola", "1 (76 g) oxtail soup mix"]
	},
	{
		"directions": "Mash the potatoes. Allow potatoes to cool until they are comfortable to handle. Mix the potatoes with the peppers, salt and juice from half a lemon. Knead until it forms a smooth paste. If the potatoes don’t stick together well, add a trickle of vegetable oil and continue kneading until it sticks. In a separate container, season the onion with salt and juice from half a lemon. In another container, shred the chicken and mix it with half the mayonnaise. Separate the potato and chili mixture into portions. For a simple presentation, form into a flat mound on a salad plate. For a more elaborate causa, use a round metal spring mold (or a soup can with both ends cut out). Cover with a layer of the onion mixture. Cover with a layer of the the chicken. (For simple presentation, use one layer of each component. For elaborate presentation, use multiple thinner layers, ending with potato on the top.). Chill before serving. Garnish with the rest of the mayonnaise, lettuce, olives or parsley. Submit a Correction",
		"url": "http://www.food.com/recipe/causa-rellena-308832",
		"title": "Causa Rellena",
		"description": "Causa is a cold, layered, potato salad from Peru. While it is just as tasty no matter how it is arranged on the plate, traditional causa's colorful layers lend themselves to spectacular presentation. This is a simplified chicken causa from the University of Illinois Extension Service.",
		"small": "",
		"medium": "",
		"large": "",
		"ingredients": ["2 lbs yellow potatoes, peeled and boiled", "1 cup chili pepper, minced (yellow aji)", "1 lemon", "vegetable oil (if needed)", "1 teaspoon salt", "2 skinless chicken breasts, cooked (10-12 ounces)", "1 red onion, chopped", "1 cup reduced-calorie mayonnaise", "lettuce leaf", "olive", "parsley"]
	}
]
